//------------------------------------------------------------------------------
/// @file
/// @author   ハル研究所プログラミングコンテスト実行委員会
///
/// @copyright  Copyright (c) 2017 HAL Laboratory, Inc.
/// @attention  このファイルの利用は、同梱のREADMEにある
///             利用条件に従ってください。
//------------------------------------------------------------------------------

#pragma once

namespace hpc {

//------------------------------------------------------------------------------
/// UFOの種類。
enum UFOType
{
    UFOType_Large, ///< 大型タイプです。
    UFOType_Small, ///< 小型タイプです。

    UFOType_TERM,
};

} // namespace
// EOF
