//------------------------------------------------------------------------------
/// @file
/// @author   ハル研究所プログラミングコンテスト実行委員会
///
/// @copyright  Copyright (c) 2016 HAL Laboratory, Inc.
/// @attention  このファイルの利用は、同梱のREADMEにある
///             利用条件に従ってください。
//------------------------------------------------------------------------------

#include "Parameter.hpp"

namespace hpc {

//------------------------------------------------------------------------------
/// 宇宙船の速度上限
float Parameter::ShipMaxSpeed()
{
    return 2.0f;
}

} // namespace
// EOF
